{
  "backend/main.mo": "Defines the main canister with data types for tasks, finances, user profiles, documents, bans, and tap‑to‑earn state plus storage maps and mixins.",
  "backend/migration.mo": "Contains a migration that upgrades tap‑to‑earn state by adding a remainderTaps field while preserving existing data.",
  "feature_evidence.json": "Lists feature evidence records mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten one‑sentence summaries for many frontend files used in the project.",
  "frontend/index.css": "Defines Tailwind base styles and OKLCH color tokens for light and dark theme palettes.",
  "frontend/index.html": "HTML entry point setting Bangla locale and loading the main frontend script.",
  "frontend/src/App.tsx": "Main React app component handling authentication state, ban checks, theming, and routing shell.",
  "frontend/src/components/ads/TapToEarnAdInterstitial.tsx": "Interstitial ad dialog for tap‑to‑earn, loading external ads when available and falling back to local creatives.",
  "frontend/src/components/app/AppShell.tsx": "Main application layout handling auth state, bans, profile view toggling, and rendering primary tabs or onboarding UI.",
  "frontend/src/components/app/PrimaryTabs.tsx": "Renders three main tabs (earn, finance, e-services) with their respective landing components.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity authentication and query cache clearing.",
  "frontend/src/components/kyc/VerificationRequiredDialog.tsx": "Dialog prompting users to complete email or NID verification before accessing restricted features.",
  "frontend/src/components/policy/BanNoticeBanner.tsx": "Displays a destructive alert banner if the user account is banned, showing the ban reason.",
  "frontend/src/components/policy/PolicyAcceptanceGate.tsx": "Gates app content behind mandatory terms/privacy acceptance stored per principal in localStorage.",
  "frontend/src/components/profile/ProfileOnboardingModal.tsx": "Modal for creating a new user profile with required fields and saving via mutation.",
  "frontend/src/components/referrals/ReferralCard.tsx": "Shows the user’s referral code, copy button, and referral count.",
  "frontend/src/config/ads.ts": "Defines configurable external ad settings for tap-to-earn features with fallback control.",
  "frontend/src/hooks/queries/useAccessControl.ts": "Queries the caller’s user role and admin status via actor methods.",
  "frontend/src/hooks/queries/useBanStatus.ts": "Provides hooks to query, ban, and unban users, tied to principal-based ban status.",
  "frontend/src/hooks/queries/useCurrentUserProfile.ts": "Fetches and saves the caller’s user profile using actor methods with cache invalidation.",
  "frontend/src/hooks/queries/useDocuments.ts": "Queries and mutations for fetching documents and uploading encrypted sensitive documents with cache invalidation.",
  "frontend/src/hooks/queries/useEarnings.ts": "Fetches user balance and referral bonus using actor methods.",
  "frontend/src/hooks/queries/useEServices.ts": "Provides hooks to fetch e‑service requests and submit new service requests with related cache updates.",
  "frontend/src/hooks/queries/useFinance.ts": "Hooks for fetching and submitting micro‑loan and DPS requests, handling success and error toasts.",
  "frontend/src/hooks/queries/useReferrals.ts": "Manages referral code, referral list retrieval, and registration mutations.",
  "frontend/src/hooks/queries/useTapToEarn.ts": "Implements Tap‑to‑Earn state queries, tap registration, batching, and coin claiming with cache refresh.",
  "frontend/src/hooks/queries/useTasks.ts": "Hooks to fetch task catalog and completed tasks plus mutations to start and complete tasks with rewards.",
  "frontend/src/hooks/queries/useWithdrawals.ts": "Handles fetching withdrawal requests and submitting new withdrawal operations with balance refresh.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity authentication, storing identity and handling login states.",
  "frontend/src/hooks/useTapBatching.ts": "Utility hook batching tap events, performing timed flushes, optimistic updates, and error recovery.",
  "frontend/src/hooks/useTapToEarnAdScheduler.ts": "React hook managing tap-to-earn ad display state, handling scheduling, closing, and ban-based cancellation.",
  "frontend/src/i18n/bn-BD.ts": "Bangla localization file containing UI strings for common actions, earnings, finance, withdrawal, and tap-to-earn features.",
  "frontend/src/i18n/index.ts": "Provides translation lookup and interpolation for bn-BD strings plus BDT currency and number formatters.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining color themes for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, global styles, and rendering the App component.",
  "frontend/src/pages/admin/AdminBanPanel.tsx": "Admin UI for banning and unbanning users by principal ID with form handling, validation, and error display.",
  "frontend/src/pages/earn/EarningsDashboard.tsx": "Dashboard showing user balance, task earnings, referrals, and referral bonus using query-based data.",
  "frontend/src/pages/earn/EarnLanding.tsx": "Landing page for earnings features with navigation between tasks, withdrawals, and tap-to-earn views.",
  "frontend/src/pages/earn/TapToEarnPage.tsx": "Implements tap-to-earn logic with optimistic state, ad scheduling at tap thresholds, and coin claiming while handling bans. Manages tap events, ad triggers, and UI interactions for earning coins.",
  "frontend/src/pages/earn/TaskCatalog.tsx": "Displays available tasks grouped by type with icons and rewards, allowing users to select a task for details. Handles loading states and empty task lists.",
  "frontend/src/pages/earn/TaskDetail.tsx": "Shows task details, instructions, and allows starting and submitting proof for a task. Prevents interaction when banned and handles form submission states.",
  "frontend/src/pages/earn/WithdrawPage.tsx": "Provides withdrawal form with support for bank, mobile, and global methods, validating inputs and sending withdrawal requests. Also displays balance, past requests, and ban restrictions.",
  "frontend/src/pages/eservices/EServiceHistoryPage.tsx": "Lists the user's past e‑service requests with status indicators and descriptions. Handles loading and empty history states.",
  "frontend/src/pages/eservices/EServiceLanding.tsx": "Landing page to browse e‑services, navigate to request forms, or view history. Renders service cards and manages view transitions.",
  "frontend/src/pages/eservices/EServiceRequestPage.tsx": "Form page for submitting e-service requests with email verification and ban checks.",
  "frontend/src/pages/finance/DollarBuySellPage.tsx": "Placeholder page showing that dollar buy/sell functionality is coming soon.",
  "frontend/src/pages/finance/DPSPage.tsx": "Allows users to create DPS requests with amount, term, and purpose, requiring NID verification.",
  "frontend/src/pages/finance/FinanceLanding.tsx": "Landing hub for finance features, routing between loan, DPS, transfer, and dollar exchange views.",
  "frontend/src/pages/finance/MicroLoanPage.tsx": "Provides a micro-loan application form with amount, purpose, and repayment inputs, gated by NID verification.",
  "frontend/src/pages/finance/MoneyTransferPage.tsx": "Placeholder page indicating money transfer features are under development.",
  "frontend/src/pages/kyc/KYCPage.tsx": "KYC document upload page supporting encrypted uploads for various identity document types.",
  "frontend/src/pages/profile/ProfilePage.tsx": "React profile page allowing viewing and editing user info, navigating to KYC and admin panels, and displaying referral data.",
  "frontend/src/types/monetag.d.ts": "Empty TypeScript declaration file placeholder for Monetag types.",
  "frontend/src/utils/ads/inventory.ts": "Defines static ad creatives and provides functions to fetch ads sequentially, randomly, or based on tap thresholds.",
  "frontend/src/utils/ads/monetag.ts": "Empty utility file reserved for Monetag ad logic.",
  "frontend/src/utils/crypto/clientEncryption.ts": "Implements AES‑GCM client‑side encryption and decryption for document bytes using Web Crypto API.",
  "frontend/src/utils/currency.ts": "Utility functions for formatting, parsing, and converting BDT amounts plus tap‑to‑earn coin credit calculations.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters, supporting hash‑based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and container settings with plugins for typography, queries, and animations.",
  "project_state.json": "Project metadata describing Bangla localization, BDT currency rules, and ad system updates."
}