{
  "backend/main.mo": "Defines Motoko actor with extensive types for tasks, financial operations, user profiles, verification, bans, and state maps for storing app data.",
  "feature_evidence.json": "Lists feature evidence linking tap-to-earn optimistic UI, batching, and ad-trigger changes to specific frontend files and components.",
  "frontend-file-summaries.txt": "Contains concise descriptions of many frontend files, including hooks, pages, components, utilities, and theme settings.",
  "frontend/index.css": "Sets global Tailwind CSS variables for light and dark themes using OKLCH color tokens and applies base styles.",
  "frontend/index.html": "HTML entry point loading the React app and setting the page title.",
  "frontend/src/App.tsx": "Main app wrapper handling authentication, profile onboarding, policy gate, theming, and loading state.",
  "frontend/src/components/app/AppShell.tsx": "Layout component providing header, navigation, footer, and profile view toggle with ban banner support.",
  "frontend/src/components/app/PrimaryTabs.tsx": "Three-tab navigation component switching between Earn, Finance, and E‑Service sections.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button switching between login and logout while handling Internet Identity state and query cache reset.",
  "frontend/src/components/kyc/VerificationRequiredDialog.tsx": "Shows a dialog prompting users to verify email or NID before accessing restricted features, with messaging based on the verification type.",
  "frontend/src/components/policy/BanNoticeBanner.tsx": "Displays a banner warning banned users with the ban reason and restrictions pulled from ban status.",
  "frontend/src/components/policy/PolicyAcceptanceGate.tsx": "Blocks app usage until the user reads and accepts terms and privacy policy, storing acceptance in localStorage per principal.",
  "frontend/src/components/profile/ProfileOnboardingModal.tsx": "Modal for creating a user profile with basic info and referral code, saving via mutation with validation and toasts.",
  "frontend/src/components/referrals/ReferralCard.tsx": "Shows the user's referral code with copy support and displays the number of referrals.",
  "frontend/src/hooks/queries/useAccessControl.ts": "Provides hooks to fetch the caller's user role and admin status via actor queries.",
  "frontend/src/hooks/queries/useBanStatus.ts": "Hooks to query a user's ban status and perform ban/unban mutations with cache invalidation.",
  "frontend/src/hooks/queries/useCurrentUserProfile.ts": "Hooks to fetch and save the caller's user profile, handling loading states and errors.",
  "frontend/src/hooks/queries/useDocuments.ts": "Fetches user documents and provides a mutation for uploading encrypted sensitive documents.",
  "frontend/src/hooks/queries/useEarnings.ts": "Fetches the user's earnings balance and referral bonus using actor queries.",
  "frontend/src/hooks/queries/useEServices.ts": "Hooks for fetching and submitting e-service requests with success/error toasts.",
  "frontend/src/hooks/queries/useFinance.ts": "Provides hooks for fetching and submitting micro-loan and DPS requests with cache updates and toasts.",
  "frontend/src/hooks/queries/useReferrals.ts": "Hooks to get referral code, list referrals, and register a referral with cache invalidation.",
  "frontend/src/hooks/queries/useTapToEarn.ts": "Provides React Query hooks for fetching tap-to-earn state, registering taps (single or batched), and claiming tap-to-earn rewards.",
  "frontend/src/hooks/queries/useTasks.ts": "Defines hooks to load task catalogs, completed tasks, and to start or submit completion of tasks with server updates.",
  "frontend/src/hooks/queries/useWithdrawals.ts": "Hooks for retrieving withdrawal requests and submitting new withdrawal requests while updating related queries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context handling login, stored identity loading, and identity lifecycle via AuthClient.",
  "frontend/src/hooks/useTapBatching.ts": "Handles batching of tap events with timed or size‑based flushes and optimistic UI updates.",
  "frontend/src/index.css": "Tailwind base/theme configuration defining color variables and global styling rules.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/admin/AdminBanPanel.tsx": "Admin UI component enabling banning and unbanning users via form inputs and corresponding mutation hooks.",
  "frontend/src/pages/earn/EarningsDashboard.tsx": "Displays balance, task earnings, referral counts, and bonus percentages using data from earnings and referral hooks.",
  "frontend/src/pages/earn/EarnLanding.tsx": "Main earn hub that switches between landing, tasks, withdraw, and tap-to-earn views using state and card navigation.",
  "frontend/src/pages/earn/TapToEarnPage.tsx": "Implements tap-to-earn gameplay with ad triggers, optimistic tap batching, banning checks, and coin claiming logic.",
  "frontend/src/pages/earn/TaskCatalog.tsx": "Fetches and groups tasks by type, showing selectable task cards that open a detailed task view.",
  "frontend/src/pages/earn/TaskDetail.tsx": "Shows task details, allows starting and submitting proof for a task, and disables actions if the user is banned.",
  "frontend/src/pages/earn/WithdrawPage.tsx": "Handles withdrawal requests with form inputs for different method types and displays balance and request history with ban checks.",
  "frontend/src/pages/eservices/EServiceHistoryPage.tsx": "Displays a list of the user's e‑service requests with status badges and basic details. Shows a loading state and a message when no requests exist.",
  "frontend/src/pages/eservices/EServiceLanding.tsx": "Provides a landing page for selecting e‑services, navigating to request forms or history. Renders service cards and handles view switching.",
  "frontend/src/pages/eservices/EServiceRequestPage.tsx": "Renders a form to submit a new e‑service request with validation for bans and email verification. Sends the request and shows alerts or verification prompts as needed.",
  "frontend/src/pages/finance/DollarBuySellPage.tsx": "Placeholder page announcing upcoming dollar buy/sell functionality. Shows informational alerts and a coming‑soon card.",
  "frontend/src/pages/finance/DPSPage.tsx": "Allows users to create a new DPS savings plan and lists their existing DPS requests. Includes form inputs for amount, term, and purpose with ban restrictions.",
  "frontend/src/pages/finance/FinanceLanding.tsx": "Landing page for finance features, routing users to micro loans, DPS, transfers, or currency exchange. Displays selectable cards for each finance service.",
  "frontend/src/pages/finance/MicroLoanPage.tsx": "Provides a form to request micro loans with NID verification checks and ban restrictions. Also displays the user's previous loan requests.",
  "frontend/src/pages/finance/MoneyTransferPage.tsx": "Displays a placeholder UI indicating the money transfer feature is coming soon.",
  "frontend/src/pages/kyc/KYCPage.tsx": "Provides a KYC document upload form with client-side encryption and status alerts.",
  "frontend/src/pages/profile/ProfilePage.tsx": "Handles user profile viewing and editing, referral data, and navigation to KYC or admin panels.",
  "frontend/src/types/monetag.d.ts": "Adds an optional Monetag ad function to the Window type.",
  "frontend/src/utils/ads/monetag.ts": "Loads the Monetag ad script and exposes a function to display ads once loaded.",
  "frontend/src/utils/crypto/clientEncryption.ts": "Implements AES‑GCM encryption and decryption utilities for sensitive document data.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme settings, colors, animations, and plugin integrations.",
  "project_state.json": "Tracks project state for improving Tap-to-Earn responsiveness, listing existing features, known issues, and pending feature requests related to optimistic UI and batched taps."
}